//   В методе calculate класса Calculator реализовать калькулятор, который будет выполнять математические операции
//   (+, -, *, /) над двумя целыми числами и возвращать результат вещественного типа. В классе Printer необходимо
//   реализовать проверку переданного оператора, при некорректном операторе программа должна вывести сообщение
//   об ошибке "Некорректный оператор: 'оператор'".
//
//   Аргументы, передаваемые в метод/функцию:
//        '3'
//        '+'
//        '7'
//   На выходе:
//              10.0

public class Calculator {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}